In [1]:
!pip install cx_Oracle

Collecting cx_Oracle
  Downloading cx_Oracle-8.0.1-cp38-cp38-win_amd64.whl (203 kB)
Installing collected packages: cx-Oracle
Successfully installed cx-Oracle-8.0.1

In [2]:
import pandas as pd
import cx_Oracle as co
from datetime import datetime

In [15]:

dsn_tns = co.makedsn('localhost', '1521', service_name="orcl")
con = co.connect(user="ljs", password="1234", dsn=dsn_tns)
cur = con.cursor()
qr = 'select * from EMP'
cur.execute(qr)
dept = dict()
deft = pd.DataFrame([{'NAME':a,'AGE':b,'SALARY':c} for a,b,c in cur.execute(qr)])
deft

   NAME  AGE  SALARY
0   이순신   44     300
1    세종   52     500
2  신사임당   25     400
3   유관순   16     200
4   윤봉길   35     250